Revit 2024 API
Wall.IsStackedWall Property
 Identifies if the wall is a stacked wall.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public bool IsStackedWall { get; }
Visual Basic
Public ReadOnly Property IsStackedWall As Boolean
	Get
Visual C++
public:
property bool IsStackedWall {
	bool get ();
}
See Also
Wall Class
Autodesk.Revit.DB Namespace